In [2]:
import os
import pandas as pd
os.listdir('.')

['.git',
 'abalone.data',
 'friend.csv',
 'new_friend.csv',
 'numpy_Practice1.ipynb',
 'pandas_Practice1.ipynb']

In [3]:
# 데이터 폴더 src 변수 할당
base_src = 'D:/공부/python'

# friend.csv 파일 src 변수 할당
friend_src = base_src + '/friend.csv'

In [4]:
# pandas의 read_csv -> 데이터 불러오기
df = pd.read_csv(friend_src, encoding='utf-8')

In [5]:
# head() 데이터를 읽어보기 => 5개만 읽기 -> 괄호 안에 숫자 지정하면 여러 개 읽을 수 있음
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
new_friend_src = base_src + "/new_friend.csv"

In [7]:
new_friend_src

'D:/공부/python/new_friend.csv'

In [8]:
# index=False 꼭 하기(필요없는 데이터는 안가져오게 하려고)
df.to_csv(new_friend_src,index=False,encoding='utf-8')

In [9]:
os.listdir(base_src)

['.git',
 'abalone.data',
 'friend.csv',
 'new_friend.csv',
 'numpy_Practice1.ipynb',
 'pandas_Practice1.ipynb']

In [10]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [11]:
# Series 실습
import numpy as np
np.array([1, 2, 3])

array([1, 2, 3])

In [12]:
# 데이터프레임(집합) => 시리즈(단일) => 데이터프레임
series = df['name']
series

0     John
1    Jenny
2     Nate
3    Julia
4    Brian
5    Chris
Name: name, dtype: object

In [13]:
# pd.Series 함수를 통해서 만드는 것도 가능
series = pd.Series([1, 2, 3, 4])
series

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
# pd.Series의 옵션이 무엇이 있는지 확인
# index => 할당값의 지정 이름, 중복 가능['a','a', 'b', 'c']
# dtype => 대표적 : int, float, string, boolean 등
series = pd.Series([1, 2, 3, 4], index=['a','b', 'c', 'd'], dtype=float)
series

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [15]:
series = pd.Series([10, 2, 5, 4], index=['a','b','c','d'], dtype=float)
series.sort_values(ascending=True) # 오름차순(기본값)

b     2.0
d     4.0
c     5.0
a    10.0
dtype: float64

In [16]:
series.sort_values(ascending=False) # 내림차순

a    10.0
c     5.0
d     4.0
b     2.0
dtype: float64

In [17]:
# DataFrame 실습
df = pd.DataFrame({'a':[2,3], 'b':[5, 10]})
df

   a   b
0  2   5
1  3  10

In [18]:
df = pd.DataFrame([[2, 5], [3, 10], [10, 20]], columns=['a', 'b'])
df

    a   b
0   2   5
1   3  10
2  10  20

In [19]:
# - DataFrame 행, 열 선택 및 필터링
df = pd.read_csv(friend_src, encoding='utf-8')
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [20]:
# index 2번에 해당하는 row 가져오기
# 시리즈 형태
df.iloc[4]

name      Brian
age          45
job     manager
Name: 4, dtype: object

In [21]:
# 데이터프레임 형태로 가져오기
df.iloc[[2]]

   name  age      job
2  Nate   30  teacher

In [22]:
# 컬럼만 보고싶은 경우
df['job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [23]:
df.loc[:,'job']

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [24]:
df.iloc[:, 2]

0      student
1    developer
2      teacher
3      dentist
4      manager
5       intern
Name: job, dtype: object

In [25]:
df.index = [0, 1, 2,3,4,5]

In [26]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [27]:
df.iloc[2]

name       Nate
age          30
job     teacher
Name: 2, dtype: object

In [28]:
df.loc[2]

name       Nate
age          30
job     teacher
Name: 2, dtype: object

In [29]:
import numpy as np

In [30]:
# 조건 필터링 가져오기
# 30대 이상만 가져오기
# boolean 형태로 가져옴
df['age']>=30

0    False
1     True
2     True
3     True
4     True
5    False
Name: age, dtype: bool

In [31]:
df[df['age']>=30]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [32]:
# job이 intern인 사람 가져오기
df['job'] == 'intern'

0    False
1    False
2    False
3    False
4    False
5     True
Name: job, dtype: bool

In [33]:
df[df['job'] == 'intern']

    name  age     job
5  Chris   25  intern

In [34]:
# 조건 여러개
# 30대 이상 40대 이하
df[df['age'] >=30 & df['age'] <= 40]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
df[(df['age'] >=30) & (df['age'] <= 40)]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist

In [ ]:
# 조건 여러개
# 30대 미만 혹은 40대 초과
df[(df['age']<30) | (df['age']>40)]

    name  age      job
0   John   20  student
4  Brian   45  manager
5  Chris   25   intern

In [ ]:
df['job'].apply(lambda x : x in ['student', 'manager'])

0     True
1    False
2    False
3    False
4     True
5    False
Name: job, dtype: bool

In [ ]:
# in을 통한 포함 조건 걸기
df[df['job'].apply(lambda x : x in ['student', 'manager'])]

    name  age      job
0   John   20  student
4  Brian   45  manager

In [35]:
os.listdir(base_src)

['.git',
 'abalone.data',
 'friend.csv',
 'new_friend.csv',
 'numpy_Practice1.ipynb',
 'pandas_Practice1.ipynb']

In [36]:
abalone_src = base_src + '/abalone.data'

In [38]:
abalone_df = pd.read_csv(abalone_src, header=None, sep=',',names=['sex','length','diameter','height', 
                  'whole_weight','shucked_weight','viscera_weight', 
                  'shell_weight','rings'])
abalone_df

,sex,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.1500,15
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.0700,7
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.2100,9
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.1550,10
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.0550,7
...,...,...,...,...,...,...,...,...,...
4172,F,0.565,0.450,0.165,0.8870,0.3700,0.2390,0.2490,11
4173,M,0.590,0.440,0.135,0.9660,0.4390,0.2145,0.2605,10
4174,M,0.600,0.475,0.205,1.1760,0.5255,0.2875,0.3080,9
4175,F,0.625,0.485,0.150,1.0945,0.5310,0.2610,0.2960,10
4176,M,0.710,0.555,0.195,1.9485,0.9455,0.3765,0.4950,12

In [39]:
# 데이터 shape를 확인
abalone_df.shape

(4177, 9)

In [40]:
# 데이터 결측값 확인
abalone_df.isnull()

,sex,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
4172,False,False,False,False,False,False,False,False,False
4173,False,False,False,False,False,False,False,False,False
4174,False,False,False,False,False,False,False,False,False
4175,False,False,False,False,False,False,False,False,False
4176,False,False,False,False,False,False,False,False,False

In [41]:
abalone_df.isnull().sum()

sex               0
length            0
diameter          0
height            0
whole_weight      0
shucked_weight    0
viscera_weight    0
shell_weight      0
rings             0
dtype: int64

In [42]:
abalone_df.isnull().sum().sum()

0

In [43]:
# 기술통계 확인 => 연속형 변수만 확인 가능 => numerical 변수만 확인 가능
abalone_df.describe()

,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings
count,4177.000000,4177.000000,4177.000000,4177.000000,4177.000000,4177.000000,4177.000000,4177.000000
mean,0.523992,0.407881,0.139516,0.828742,0.359367,0.180594,0.238831,9.933684
std,0.120093,0.099240,0.041827,0.490389,0.221963,0.109614,0.139203,3.224169
min,0.075000,0.055000,0.000000,0.002000,0.001000,0.000500,0.001500,1.000000
25%,0.450000,0.350000,0.115000,0.441500,0.186000,0.093500,0.130000,8.000000
50%,0.545000,0.425000,0.140000,0.799500,0.336000,0.171000,0.234000,9.000000
75%,0.615000,0.480000,0.165000,1.153000,0.502000,0.253000,0.329000,11.000000
max,0.815000,0.650000,1.130000,2.825500,1.488000,0.760000,1.005000,29.000000

In [45]:
# 전복(abalone) 성별에 따라 groupby함수를 통해 집계하기
#         DataFrame[집계 변수].groupby(DataFrame[집계 대상])
# 성별을 대상으로 whole_weight를 집계하기
grouped = abalone_df['whole_weight'].groupby(abalone_df['sex'])

In [47]:
# 합계
grouped.sum()

sex
F    1367.8175
I     578.8885
M    1514.9500
Name: whole_weight, dtype: float64

In [48]:
grouped.mean()

sex
F    1.046532
I    0.431363
M    0.991459
Name: whole_weight, dtype: float64

In [49]:
# 개수
grouped.size()

sex
F    1307
I    1342
M    1528
Name: whole_weight, dtype: int64

In [50]:
# 그룹변수가 하나가 아닌, 전체 연속형 변수에 대한 집계
abalone_df.groupby(abalone_df['sex']).mean()

,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings
sex,,,,,,,,
F,0.579093,0.454732,0.158011,1.046532,0.446188,0.230689,0.302010,11.129304
I,0.427746,0.326494,0.107996,0.431363,0.191035,0.092010,0.128182,7.890462
M,0.561391,0.439287,0.151381,0.991459,0.432946,0.215545,0.281969,10.705497

In [51]:
# 다음과 같이 간단하게 표현
abalone_df.groupby('sex').mean()

,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings
sex,,,,,,,,
F,0.579093,0.454732,0.158011,1.046532,0.446188,0.230689,0.302010,11.129304
I,0.427746,0.326494,0.107996,0.431363,0.191035,0.092010,0.128182,7.890462
M,0.561391,0.439287,0.151381,0.991459,0.432946,0.215545,0.281969,10.705497

In [54]:
# 새로운 조건에 맞는 변수 추가
abalone_df['length_bool'] = np.where(abalone_df['length']>abalone_df['length'].median(), 
                                     'length_long', # True일 경우
                                     'length_short') # False일 경우

In [55]:
abalone_df

,sex,length,diameter,height,whole_weight,shucked_weight,viscera_weight,shell_weight,rings,length_bool
0,M,0.455,0.365,0.095,0.5140,0.2245,0.1010,0.1500,15,length_short
1,M,0.350,0.265,0.090,0.2255,0.0995,0.0485,0.0700,7,length_short
2,F,0.530,0.420,0.135,0.6770,0.2565,0.1415,0.2100,9,length_short
3,M,0.440,0.365,0.125,0.5160,0.2155,0.1140,0.1550,10,length_short
4,I,0.330,0.255,0.080,0.2050,0.0895,0.0395,0.0550,7,length_short
...,...,...,...,...,...,...,...,...,...,...
4172,F,0.565,0.450,0.165,0.8870,0.3700,0.2390,0.2490,11,length_long
4173,M,0.590,0.440,0.135,0.9660,0.4390,0.2145,0.2605,10,length_long
4174,M,0.600,0.475,0.205,1.1760,0.5255,0.2875,0.3080,9,length_long
4175,F,0.625,0.485,0.150,1.0945,0.5310,0.2610,0.2960,10,length_long
4176,M,0.710,0.555,0.195,1.9485,0.9455,0.3765,0.4950,12,length_long

In [56]:
# 그룹변수를 2개 이상 선택해서 총계 처리?
abalone_df.groupby(['sex', 'length_bool']).mean()

                    length  diameter    height  whole_weight  shucked_weight  \
sex length_bool
F   length_long   0.626895  0.493020  0.169944      1.261330        0.542957
    length_short  0.477428  0.373301  0.132632      0.589702        0.240380
I   length_long   0.584495  0.452952  0.150957      0.923215        0.402524
    length_short  0.402210  0.305893  0.100997      0.351234        0.156581
M   length_long   0.623359  0.489291  0.168670      1.255182        0.554312
    length_short  0.454875  0.353336  0.121664      0.538157        0.224335

                  viscera_weight  shell_weight      rings
sex length_bool
F   length_long         0.276945      0.360013  11.415073
    length_short        0.132311      0.178650  10.521531
I   length_long         0.196912      0.273247  10.585106
    length_short        0.074920      0.104549   7.451473
M   length_long         0.272203      0.351683  11.299172
    length_short        0.118156      0.162141   9.685053

In [57]:
# 간결하게 표현 가능
abalone_df.groupby(['sex', 'length_bool'])['whole_weight'].mean()

sex  length_bool
F    length_long     1.261330
     length_short    0.589702
I    length_long     0.923215
     length_short    0.351234
M    length_long     1.255182
     length_short    0.538157
Name: whole_weight, dtype: float64